Repository: syjiangrui/localcast
Catalog: swiftui_app/LocalCast/Localization/Localizable.xcstrings
Source language: zh_hans
Languages: en

# appTitle
source: 本地投屏助手
en: LocalCast

# castingTo %@
source: 投屏到 %@
en: Casting to %@

# chooseDevice
source: 选择设备
en: Choose Device

# dragAndDropHint
source: 拖放视频文件到此处，或
en: Drag & drop a video file here, or

# dropVideoHere
source: 将视频文件拖放到此处
en: Drop video file here

# historyEmpty
source: 暂无播放记录
en: No recent files

# historyFileMissing
source: 文件不存在
en: File not found

# historyTitle
source: 最近播放
en: Recent

# historyToggle
source: 切换历史记录
en: Toggle history

# networkTipCheckNetwork
source: 确认电脑已连接到网络
en: Make sure your computer is connected to the network

# networkTipFirewall
source: 检查防火墙是否阻止了网络发现
en: Check if your firewall is blocking network discovery

# networkTipLocalNetwork
source: 前往「系统设置 → 隐私与安全性 → 本地网络」，确认本应用已获得权限
en: Go to System Settings → Privacy & Security → Local Network and grant access to this app

# networkTipSameNetwork
source: 确认电视与电脑在同一局域网内
en: Ensure your TV and computer are on the same local network

# networkTroubleshootHint
source: 请检查以下设置：
en: Please check the following:

# networkTroubleshootTitle
source: 扫描设备失败
en: Device scan failed

# noDevice
source: 无设备
en: No device

# noDevicesFound
source: 未找到 DLNA 设备
en: No DLNA devices found

# noDevicesHint
source: 请确保电视已开启并连接到同一网络
en: Make sure your TV is on and connected to the same network

# noFile
source: 无文件
en: No file

# nowPlaying
source: 正在播放
en: Now Playing

# playbackState.Loading...
source: 加载中...
en: Loading...

# playbackState.No Media
source: 无媒体
en: No Media

# playbackState.Paused
source: 已暂停
en: Paused

# playbackState.Playing
source: 播放中
en: Playing

# playbackState.Stopped
source: 已停止
en: Stopped

# replay
source: 重新播放
en: Replay

# rescan
source: 重新扫描
en: Rescan

# retry
source: 重试
en: Retry

# scanAgain
source: 重新扫描
en: Scan Again

# scanningDevices
source: 正在扫描 DLNA 设备...
en: Scanning for DLNA devices...

# seekBackward5Min
source: 后退5分钟
en: -5 min

# seekBackward30s
source: 后退30秒
en: -30s

# seekForward5Min
source: 前进5分钟
en: +5 min

# seekForward30s
source: 前进30秒
en: +30s

# selectDeviceTitle
source: 选择设备
en: Select Device

# selectVideoFile
source: 选择视频文件
en: Select Video File

# selectVideoTitle
source: 选择要投屏的视频文件
en: Select a video file to cast

# stop
source: 停止
en: Stop

# supportedFormats
source: 支持格式：MP4、MKV、AVI、WebM、MOV
en: Supported formats: MP4, MKV, AVI, WebM, MOV
